/*
  Localizable.strings (Español)
  ClipArc

  Created by Adam Lyu on 2026-01-22.
*/

// MARK: - Common
"app.name" = "ClipArc";
"common.enable" = "Activar";
"common.disable" = "Desactivar";
"common.cancel" = "Cancelar";
"common.done" = "Listo";
"common.save" = "Guardar";
"common.delete" = "Eliminar";
"common.copy" = "Copiar";
"common.paste" = "Pegar";
"common.search" = "Buscar";
"common.settings" = "Ajustes";
"common.continue" = "Continuar";
"common.skip" = "Omitir";
"common.skip_for_now" = "Omitir por ahora";
"common.edit" = "Editar";
"common.select_all" = "Seleccionar todo";

// MARK: - Language
"language.system" = "Predeterminado del sistema";

// MARK: - Onboarding Welcome
"onboarding.welcome.title" = "Bienvenido a ClipArc";
"onboarding.welcome.subtitle" = "Tu gestor de portapapeles inteligente para macOS";
"onboarding.welcome.get_started" = "Comenzar";

// MARK: - Onboarding Features
"onboarding.feature.history.title" = "Historial del portapapeles";
"onboarding.feature.history.description" = "Accede a todo lo que has copiado";
"onboarding.feature.search.title" = "Búsqueda instantánea";
"onboarding.feature.search.description" = "Encuentra cualquier clip en segundos";
"onboarding.feature.hotkey.title" = "Atajo global";
"onboarding.feature.hotkey.description" = "⇧⌘V desde cualquier lugar";

// MARK: - Onboarding Permissions
"onboarding.permissions.title" = "Permisos";
"onboarding.permissions.subtitle" = "ClipArc necesita algunos permisos para funcionar correctamente";
"onboarding.permissions.accessibility.title" = "Accesibilidad";
"onboarding.permissions.accessibility.description" = "Necesario para pegar automáticamente";
"onboarding.permissions.launch_at_login.title" = "Abrir al iniciar sesión";
"onboarding.permissions.launch_at_login.description" = "Iniciar ClipArc automáticamente";

// MARK: - Onboarding Sign In
"onboarding.signin.title" = "Iniciar sesión";
"onboarding.signin.subtitle" = "Inicia sesión con Apple para sincronizar entre dispositivos";
"onboarding.signin.signed_in_as" = "Conectado como";
"onboarding.signin.sign_in_later" = "Puedes iniciar sesión más tarde en Ajustes";

// MARK: - Onboarding Subscription
"onboarding.subscription.title" = "Libera todo tu potencial";
"onboarding.subscription.subtitle" = "Nunca más pierdas un elemento copiado";
"onboarding.subscription.subscribe" = "Suscribirse";
"onboarding.subscription.start_free_trial" = "Continuar con versión gratuita";
"onboarding.subscription.free_vs_pro" = "Gratis: 5 elementos · Pro: Ilimitado";
"onboarding.subscription.you_are_pro" = "¡Eres Pro!";
"onboarding.subscription.save_44" = "MEJOR VALOR";
"onboarding.subscription.benefit1" = "Historial ilimitado del portapapeles";
"onboarding.subscription.benefit2" = "Guarda texto, imágenes y archivos";
"onboarding.subscription.benefit3" = "Búsqueda instantánea en todos los clips";
"onboarding.subscription.benefit4" = "Almacenamiento local privado y seguro";

// MARK: - Onboarding Complete
"onboarding.complete.title" = "¡Todo listo!";
"onboarding.complete.subtitle" = "ClipArc está listo para usar";
"onboarding.complete.start_using" = "Comenzar a usar ClipArc";
"onboarding.complete.tip.open" = "Abrir historial del portapapeles";
"onboarding.complete.tip.navigate" = "Navegar entre elementos";
"onboarding.complete.tip.paste" = "Pegar elemento seleccionado";
"onboarding.complete.tip.close" = "Cerrar panel";

// MARK: - Settings
"settings.title" = "Ajustes";
"settings.general" = "General";
"settings.account" = "Cuenta";
"settings.subscription" = "Suscripción";
"settings.about" = "Acerca de";

"settings.history_limit" = "Límite del historial";
"settings.items" = "elementos";
"settings.startup" = "Inicio";
"settings.launch_at_login" = "Abrir al iniciar sesión";
"settings.show_in_dock" = "Mostrar en el Dock";
"settings.hotkey" = "Atajo";
"settings.global_hotkey" = "Atajo global";
"settings.permissions" = "Permisos";
"settings.granted" = "Concedido";
"settings.language" = "Idioma";
"settings.restart_required" = "Reinicia la app para aplicar el cambio de idioma";
"settings.appearance" = "Apariencia";
"settings.appearance.system" = "Sistema";
"settings.appearance.light" = "Claro";
"settings.appearance.dark" = "Oscuro";

"settings.sign_out" = "Cerrar sesión";
"settings.sync_description" = "Inicia sesión para sincronizar tus datos entre dispositivos";
"settings.member_account" = "Cuenta de miembro";
"settings.sign_in_description" = "Inicia sesión para verificar tu membresía";
"settings.account_linked" = "Cuenta vinculada";
"settings.benefit_membership" = "Verificar membresía Pro";
"settings.benefit_restore" = "Restaurar compras fácilmente";
"settings.benefit_multi_device" = "Misma cuenta en todos los dispositivos";
"settings.login_required" = "Inicio de sesión requerido";
"settings.login_required_message" = "Por favor, inicia sesión con tu Apple ID primero para suscribirte. Ve a la pestaña Cuenta para iniciar sesión.";
"settings.go_to_account" = "OK";
"settings.accessibility_guide" = "Ajustes del Sistema → Privacidad y Seguridad → Accesibilidad → Activar ClipArc";

"settings.pro_badge" = "ClipArc Pro";
"settings.lifetime_license" = "Licencia de por vida";
"settings.renews_on" = "Se renueva el %@";
"settings.manage_subscription" = "Gestionar suscripción";
"settings.upgrade_to_pro" = "Actualizar a Pro";
"settings.upgrade_description" = "Obtén historial ilimitado del portapapeles y más";
"settings.restore_purchases" = "Restaurar compras";

"settings.version" = "Versión";
"settings.about_description" = "Un gestor de portapapeles rápido y sencillo para macOS";
"settings.support" = "Soporte";
"settings.privacy" = "Privacidad";
"settings.terms" = "Términos";

// MARK: - Clipboard
"clipboard.empty.title" = "Sin clips aún";
"clipboard.empty.subtitle" = "Copia algo para comenzar";
"clipboard.search.placeholder" = "Buscar clips...";
"clipboard.search.no_results" = "No se encontraron resultados";
"clipboard.copied" = "Copiado";
"clipboard.pasted" = "Pegado";

"clipboard.type.all" = "Todo";
"clipboard.type.frequent" = "Frecuente";
"clipboard.type.text" = "Texto";
"clipboard.type.image" = "Imagen";
"clipboard.type.file" = "Archivo";
"clipboard.type.link" = "Enlace";
"clipboard.delete_selected" = "Eliminar seleccionados";

// MARK: - Menu Bar
"menu.show_panel" = "Mostrar ClipArc";
"menu.preferences" = "Preferencias...";
"menu.clear_history" = "Borrar historial";
"menu.about" = "Acerca de ClipArc";
"menu.help" = "Ayuda";
"menu.quit" = "Salir de ClipArc";

// MARK: - Rating
"rating.title" = "¿Te gusta ClipArc?";
"rating.subtitle" = "Tu opinión nos ayuda a mejorar";
"rating.yes_love_it" = "¡Sí, me encanta!";
"rating.not_really" = "No mucho";

// MARK: - Errors
"error.generic" = "Ocurrió un error. Por favor, inténtalo de nuevo.";
"error.auth_failed" = "Falló la autenticación. Por favor, inténtalo de nuevo.";
"error.purchase_failed" = "Falló la compra. Por favor, inténtalo de nuevo.";
"error.network" = "Error de red. Por favor, verifica tu conexión.";

// MARK: - Time
"time.just_now" = "Ahora mismo";
"time.minutes_ago" = "Hace %d min";
"time.hours_ago" = "Hace %d h";
"time.yesterday" = "Ayer";
"time.days_ago" = "Hace %d días";

// MARK: - Toast
"toast.running" = "Ejecutándose en segundo plano";

"settings.storage" = "Almacenamiento";
"settings.cache_size" = "Tamaño de caché";
"settings.history_items" = "Elementos del historial";
"settings.clear_cache" = "Limpiar caché";
"settings.clear_cache_message" = "Esto eliminará todas las imágenes y miniaturas en caché. Tu historial del portapapeles se conservará.";
"settings.clear_all_history" = "Borrar todo el historial";
"settings.clear_history_message" = "Esto eliminará permanentemente todo el historial del portapapeles. Esta acción no se puede deshacer.";
"settings.clear" = "Borrar";
